app/controllers/users_controller.rb

	def index
		@users = User.all
		@users_with_active_add=User.joins(:addresses).where('addresses.is_active=?',true)
		@users_with_non_active_add=User.joins(:addresses).where('addresses.is_active=?',false)
		@user_without_address=[]
         @users.each do |u|
         if u.addresses.empty?
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" INNER JOIN "addresses" ON "addresses"."user_id" = "users"."id" WHERE (addresses.is_active=1)
SELECT  1 AS one FROM "addresses" WHERE "addresses"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]

	def create

		 @user=User.new(user_params)
		 if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "subhash"], ["created_at", "2017-12-04 04:34:16.317022"], ["updated_at", "2017-12-04 04:34:16.317022"]]

	def edit
		@user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

	def destroy
		@user=User.find_by(id: params[:id])
        if @user
		@user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

	def update
     @user = User.find(params[:id]).update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]